app/controllers/animals_controller.rb

    def index
        animals = Animal.all
---
SELECT "animals".* FROM "animals"

    def create
        animal = Animal.create(animal_params)
---
INSERT INTO "animals" ("name", "binomial", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lion"], ["binomial", "Panthera leo"], ["created_at", "2023-12-05 23:24:32.048831"], ["updated_at", "2023-12-05 23:24:32.048831"]]

    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "animals" SET "name" = $1, "binomial" = $2, "updated_at" = $3 WHERE "animals"."id" = $4  [["name", "Lion"], ["binomial", "Panthera leo"], ["updated_at", "2023-12-05 23:30:09.900023"], ["id", 2]]

    def destroy
        animal= Animal.find(params[:id])
        if animal.destroy
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 2]]