app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings"
---
    def index
        sightings = Sighting.all

INSERT INTO "sightings" ("latitude", "longitude", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", "9999"], ["longitude", "8888"], ["date", "1-4-2000"], ["created_at", "2023-12-06 00:37:06.859400"], ["updated_at", "2023-12-06 00:37:06.859400"]]
---
    def create
        sighting = Sighting.create(sighting_params)

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sightings" SET "latitude" = $1, "longitude" = $2, "date" = $3, "updated_at" = $4 WHERE "sightings"."id" = $5  [["latitude", "9999"], ["longitude", "8888"], ["date", "1-4-2000"], ["updated_at", "2023-12-06 00:43:00.177299"], ["id", 1]]
---
    def update
        sighting = Sighting.find(params[:id])
        sighting.update(sighting_params)